# Exercise 02 - OLAP Cubes -  Grouping Sets

All the databases table in this demo are based on public database samples and transformations
- `Sakila` is a sample database created by `MySql` [Link](https://dev.mysql.com/doc/sakila/en/sakila-structure.html)
- The postgresql version of it is called `Pagila` [Link](https://github.com/devrimgunduz/pagila)
- The facts and dimension tables design is based on O'Reilly's public dimensional modelling tutorial schema [Link](http://archive.oreilly.com/oreillyschool/courses/dba3/index.html)

Start by connecting to the database by running the cells below. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed the slicing and dicing exercise, then skip to the second cell.

### Connect to the local database where Pagila is loaded

In [2]:
import sql
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'postgres'
DB_PASSWORD = 'Met/14/7472'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
postgresql://postgres:Met/14/7472@127.0.0.1:5432/pagila

# Grouping Sets
- It happens often that for 3 dimensions, you want to aggregate a fact:
    - by nothing (total)
    - then by the 1st dimension
    - then by the 2nd 
    - then by the 3rd 
    - then by the 1st and 2nd
    - then by the 2nd and 3rd
    - then by the 1st and 3rd
    - then by the 1st and 2nd and 3rd
    
- Since this is very common, and in all cases, we are iterating through all the fact table anyhow, there is a more clever way to do that using the SQL grouping statement "GROUPING SETS"

## Total Revenue

TODO: Write a query that calculates total revenue (sales_amount)

In [3]:
%%sql
SELECT sum(sales_amount) as revenue
FROM factsales;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
1 rows affected.

[(1741557.3799969,)]

## Revenue by Country
TODO: Write a query that calculates total revenue (sales_amount) by country

In [5]:
%%sql
SELECT c.country, sum(sales_amount) as revenue 
FROM factsales f
JOIN dimcustomer c ON (f.customer_key = c.customer_key)
GROUP BY country
ORDER BY revenue DESC
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[('India', 167571.360000021),
 ('China', 150766.21),
 ('United States', 106516.629999992),
 ('Japan', 88165.46),
 ('Mexico', 84036.7400000015)]

## Revenue by Month
TODO: Write a query that calculates total revenue (sales_amount) by month

In [6]:
%%sql 
SELECT d.month, sum(sales_amount) as revenue
FROM factsales f
JOIN dimdate d ON (f.date_key = d.date_key)
GROUP BY d.month
ORDER BY revenue DESC
LIMIT 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(4, 728359.399999138),
 (3, 614999.179999375),
 (2, 254535.340000093),
 (1, 129419.920000014),
 (5, 14243.5399999993)]

## Revenue by Month & Country
TODO: Write a query that calculates total revenue (sales_amount) by month and country. Sort the data by month, country, and revenue in descending order. The first few rows of your output should match the table below.

In [7]:
%%sql
SELECT d.month, s.country, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimstore s ON (f.store_key = s.store_key)
JOIN dimdate d on (f.date_key = d.date_key)
group by (d.month, s.country)
order by d.month, s.country, revenue desc
limit 5;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, 'Australia', 66116.7999999951),
 (1, 'Canada', 63303.119999996),
 (2, 'Australia', 129084.739999981),
 (2, 'Canada', 125450.599999982),
 (3, 'Australia', 312565.940000027)]

## Revenue Total, by Month, by Country, by Month & Country All in one shot

TODO: Write a query that calculates total revenue at the various grouping levels done above (total, by month, by country, by month & country) all at once using the grouping sets function. Your output should match the table below.

In [8]:
%%sql
SELECT d.month, s.country, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimstore s ON (f.store_key = s.store_key)
JOIN dimdate d on (f.date_key = d.date_key)
group by grouping sets ((), d.month, s.country, (d.month, s.country))
limit 20;

 * postgresql://postgres:***@127.0.0.1:5432/pagila
18 rows affected.

[(None, None, 1741557.37999655),
 (5, 'Australia', 7029.05999999965),
 (1, 'Canada', 63303.1199999908),
 (2, 'Australia', 129084.740000067),
 (4, 'Australia', 369726.159999556),
 (4, 'Canada', 358633.239999582),
 (3, 'Canada', 302433.239999697),
 (5, 'Canada', 7214.47999999964),
 (2, 'Canada', 125450.600000064),
 (1, 'Australia', 66116.7999999905),
 (3, 'Australia', 312565.939999677),
 (3, None, 614999.179999018),
 (5, None, 14243.5399999991),
 (4, None, 728359.399998766),
 (2, None, 254535.339999802),
 (1, None, 129419.920000069),
 (None, 'Canada', 857034.679998482),
 (None, 'Australia', 884522.699998429)]